from openai import OpenAI
client = OpenAI(
    api_key="sk-ZvGrSp0bVHk5rMsjL5rXwNUuk7nkobeD",
    base_url="https://api.proxyapi.ru/openai/v1",
)

def perform_request_chatGPT(data_base):
  chat_completion = client.chat.completions.create(
    model="gpt-3.5-turbo",  messages=[
      {"role": "system", "content": '''Вы - ученый-лаборант на космической станции. 
      Ваша миссия следить за ростом растений, помещенных в фитотрон с разными датчиками, установленными для отслеживания показаний, для поддержания жизнедеятельности остального экипажа. 
      При планировании полета, Вы взяли с собой 2 кг семян редиса, надеясь получить урожай, весом 30 кг.
      На протяжении 30 дней Вы следили за показаниями датчиков, записывая их. 
      За 30 дней ни один датчик не показал отклонение от допустимых значений. 
      После окончания 30 дневного периода выращивания Вы собрали урожай и заметили отклонения на 6 кг от планируемого результата в 30 кг.'''},
      {"role": "user", "content": f'''Даны следующие показания датчиков за период выращивания:
      - Влажность воздуха = {data_base['Влажность воздуха']}
      - Влажность почвы = {data_base['Влажность почвы']}
      - Температура воздуха = {data_base['Температура воздуха']}
      - Температура раствора = {data_base['Температура раствора']}
      - Давление = {data_base['Давление']}
      - Уровень раствора = {data_base['Уровень раствора']}
      - Кислотность раствора = {data_base['Кислотность раствора']}
      - Содержание ионов = {data_base['Содержание ионов']}
      - Освещенность = {data_base['Освещенность']}
      С учетом того, что ни один датчик не показал отклонений от нормы, а вес урожая получился с отклонением, проанализируй ситуацию и дай рекомендации ученому-лаборанту о том,
      что необходимо сделать, чтобы фактический вес урожая был равен планируемому. Про название растения, вес семян, вес планируемого урожая и число отклонения умолчи. 
      '''}
  ]
  )

  return chat_completion.choices[0].message